Revit 2027 API
SizingOptions.SetNextAvailableSize Method
Overload List
Name | Description
SetNextAvailableSize(Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
SetNextAvailableSize(ConnectorProfileType, Double, Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
Top
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace